Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: After registration, a new instance of any registered Component can be created with:
it_it: Dopo la registrazione, è possibile creare una nuova istanza di qualsiasi Componente registrato con:

source: After registration, the images can be referenced by their name:
it_it: Dopo la registrazione, è possibile fare riferimento alle immagini tramite il loro nome:

source: After reviewing :ref:`Adding LVGL to your project <adding_lvgl_to_your_project>`, you will appreciate the specifics of using LVGL with an STM32 HAL project covered here.
it_it: Dopo aver esaminato :ref:`Aggiungere LVGL al progetto <adding_lvgl_to_your_project>`, si apprezzeranno le specifiche sull'utilizzo di LVGL con un progetto STM32 HAL illustrate qui.

source: After that it can be added to widgets:
it_it: Successivamente è possibile aggiungere ai widget:

source: After that you can access files using that driver letter.
it_it: Dopodiché si potrà accedere ai file utilizzando quella lettera.

source: After that, clicking the FigmaSync button (top right-hand corner) will update each style with a ``figma_node_id`` from the latest Figma design.
it_it: Dopodiché, cliccando sul pulsante FigmaSync (in alto a destra), ogni stile verrà aggiornato con un ``figma_node_id`` dall'ultimo design di Figma.

source: After that, instances of the registered Components and Screens can be created.
it_it: Dopodiché, è possibile creare istanze dei Componenti e degli Screen [schermate] registrati.

source: After that, it can be used identically to image files:
it_it: Dopodiché, può essere utilizzato in modo identico ai file immagine:

source: After that, properties can be added to configure the style.
it_it: In seguito, è possibile aggiungere proprietà per configurare lo stile.

source: After that, the container is reused for future sessions.
it_it: Dopodiché, il container viene riutilizzato per le sessioni future.

source: After that, the group needs to be assigned to an input device.
it_it: In seguito, il gruppo deve essere assegnato a un dispositivo di input.

source: After that, the registered data will be available by name in the application.
it_it: Dopodiché, i dati registrati saranno disponibili per nome nell'applicazione.

source: After that, the user can check if the given widget was really scrolled by getting the Y coordinate of a child.
it_it: Dopodiché, l'utente può verificare se il widget specificato è stato effettivamente "scrollato" ottenendo la coordinata Y di un elemento figlio.

source: After that, these strings can contain any other characters, including additional Unicode characters.
it_it: Dopodiché, queste stringhe possono contenere qualsiasi altro carattere, inclusi caratteri Unicode aggiuntivi.

source: After that, you can customize the style like any Widget.
it_it: Dopodiché, si può personalizzare lo stile come qualsiasi Widget.

source: After the external events are received and handled, :cpp:func:`lv_timer_handler` should be called again.
it_it: Dopo che gli eventi esterni sono stati ricevuti e gestiti, :cpp:func:`lv_timer_handler` dovrebbe essere chiamato nuovamente.

source: After the flashing the monitor console will be launched automatically.
it_it: Dopo il flashing, la console del monitor verrà avviata automaticamente.

source: After this function is called, future changes to the language will automatically update the label's text to display the corresponding translation for that tag in the new language.
it_it: Dopo aver richiamato questa funzione, le future modifiche alla lingua aggiorneranno automaticamente il testo dell'etichetta per visualizzare la traduzione corrispondente per quel tag nella nuova lingua.

source: After this section the folder tree will be like this
it_it: Dopo questa sezione, l'albero delle cartelle sarà simile a questo

source: After this task has been completed, everything is ready to be installed.
it_it: Una volta completata questa attività, tutto è pronto per l'installazione.

source: After writing 8 rendering instructions to the command buffer, the rendering backend will call ``vg_lite_flush`` to notify the GPU to start rendering and swap the command buffer.
it_it: Dopo aver scritto 8 istruzioni di rendering nel buffer dei comandi, il backend di rendering chiamerà ``vg_lite_flush`` per notificare alla GPU di avviare il rendering e scambiare il buffer dei comandi.

source: After writing a dictionary according to the above dictionary format, you only need to call this function to set up and use your dictionary:
it_it: Dopo aver scritto un dizionario secondo il formato sopra indicato, è sufficiente chiamare questa funzione per impostarlo e utilizzarlo:

source: After you chose a board you can build one of the LVGL demos for it.
it_it: Dopo aver scelto una scheda, si può compilare una delle demo LVGL per essa.

source: After you completed the setup above you can check out all of the `provided samples <https://docs.zephyrproject.org/latest/samples/>`__ for various boards.
it_it: Dopo aver completato la configurazione sopra descritta, si possono consultare tutti gli `esempi forniti <https://docs.zephyrproject.org/latest/samples/>`__ per diverse schede.

source: After you have set up your :cpp:type:`lv_anim_t` object, it is important to realize that what you have set up is a "template" for a live, running Animation that has not been created yet.
it_it: Dopo aver impostato l'oggetto :cpp:type:`lv_anim_t`, è importante rendersi conto che ciò che si è impostato è un "template" per un'animazione in esecuzione che non è ancora stata creata.

source: After you have:
it_it: Dopo aver:

source: Afterwards set the framebuffer device node on the display (usually this is ``/dev/fb0``).
it_it: Successivamente, si imposta il nodo del dispositivo framebuffer sul display (di solito è ``/dev/fb0``).

source: Alif Semiconductor is a next-generation chip vendor making chips that come in a variety of configurations.
it_it: Alif Semiconductor è un fornitore di chip di nuova generazione che produce chip disponibili in una varietà di configurazioni.

source: Alif offers both microcontrollers and microprocessors.
it_it: Alif offre sia microcontrollori che microprocessori.

source: Align edges of text around lists of parameters for ease of reading.
it_it: Allineare i bordi del testo attorno agli elenchi di parametri per facilitarne la lettura.

source: Align to Another Widget
it_it: Allineare a un Altro Widget

source: Align to a different reference widget:
it_it: Allineare a un widget di riferimento diverso:

source: Align to the Parent
it_it: Allineare al Genitore

source: Alignment
it_it: Allineamento

source: All 4 axes come with each chart automatically (they do not have to be created).
it_it: Tutti e 4 gli assi sono inclusi automaticamente in ogni grafico (non è necessario crearli).

source: All :ref:`screens` created in association with this display (and not yet deleted---only one is displayed at any given time)
it_it: Tutti gli :ref:`screens` creati in associazione a questo display (e non ancora eliminati: ne viene visualizzato solo uno alla volta)

source: All ARM Cortex-A and Cortex-R 64-bit processors include Neon support as a mandatory feature starting with the ARMv8 architecture specification.
it_it: Tutti i processori ARM Cortex-A e Cortex-R a 64 bit includono il supporto Neon come funzionalità obbligatoria a partire dalle specifiche dell'architettura ARMv8.

source: All Flex-related values are style properties under the hood so you can use them as you would any other style property.
it_it: Tutti i valori relativi a Flex sono proprietà di stile nascoste; quindi si possono usare come qualsiasi altra proprietà di stile.

source: All LVGL event types are supported with straightforward mapping:
it_it: Tutti i tipi di evento LVGL sono supportati con una mappatura semplice:

source: All Widgets
it_it: Tutti i Widget

source: All Widgets (such as Buttons/Labels/Sliders etc.) regardless their type receive the *Input device*, *Drawing* and *Other* events.
it_it: Tutti i Widget (come Pulsanti/Label/Slider ecc.), indipendentemente dal tipo, ricevono gli eventi *Input device*, *Drawing* e *Altri*.

source: All Y-values so allocated are set to :c:macro:`LV_CHART_POINT_NONE`, which causes that point to be hidden.
it_it: Tutti i valori Y così allocati vengono impostati su :c:macro:`LV_CHART_POINT_NONE`, il che fa sì che il punto venga nascosto.

source: All ``.c``, ``.cpp``, and ``.h`` files located in the same directory as the sketch or inside the ``src`` subfolder.
it_it: Tutti i file ``.c``, ``.cpp`` e ``.h`` che si trovano nella stessa directory dello sketch o nella sottocartella ``src``.

source: All ``lv_3dtexture`` functions are also available for advanced 3D texture management
it_it: Tutte le funzioni ``lv_3dtexture`` sono disponibili anche per la gestione avanzata delle texture 3D

source: All ``lv_image`` functions are available for image-related operations
it_it: Tutte le funzioni ``lv_image`` sono disponibili per operazioni relative alle immagini.

source: All complaints will be reviewed and investigated and will result in a response that is deemed necessary and appropriate to the circumstances.
it_it: Tutti i reclami saranno esaminati e investigati e daranno luogo a una risposta ritenuta necessaria e appropriata alle circostanze.

source: All components from ``${project_dir}/components`` are automatically added to the build.
it_it: Tutti i componenti da ``${project_dir}/components`` vengono aggiunti automaticamente alla build.

source: All draw units operate with a configurable thread priority which can be set using the :c:macro:`LV_DRAW_THREAD_PRIO` configuration option in ``lv_conf.h``.
it_it: Tutte le draw unit operano con una priorità dei thread configurabile, impostabile utilizzando l'opzione di configurazione :c:macro:`LV_DRAW_THREAD_PRIO` in ``lv_conf.h``.

source: All features are detailed in the `Berry Reference Manual <https://github.com/berry-lang/berry/wiki/Reference>`__
it_it: Tutte le funzionalità sono descritte nel `Berry Reference Manual <https://github.com/berry-lang/berry/wiki/Reference>`__

source: All image features apply to layers as well.
it_it: Tutte le funzionalità dell'immagine si applicano anche ai layer.

source: All input device events (e.g. touch, keys, etc) are disabled during the Screen's animation.
it_it: Tutti gli eventi dei dispositivi di input (ad esempio touch, tasti, ecc.) sono disabilitati durante l'animazione dello Screen.

source: All integer, percentage and color style properties are supported.
it_it: Sono supportate tutte le proprietà di stile relative a numeri interi, percentuali e colori.

source: All lists (including nested lists) must be preceded and followed with at least 1 blank line for the reST parser to process it correctly.
it_it: Tutti gli elenchi (inclusi quelli nidificati) devono essere preceduti e seguiti da almeno una riga vuota affinché il parser reST li elabori correttamente.

source: All manually allocated memory needs to be freed here.
it_it: Qui è necessario liberare tutta la memoria allocata manualmente.

source: All modes support pixel units.
it_it: Tutte le modalità supportano le unità pixel.

source: All of the above have this relationship at run time:
it_it: Tutti gli elementi sopra elencati hanno questa relazione in fase di esecuzione:

source: All of the below format names are used in code by prefixing them with ``LV_COLOR_FORMAT_`` (e.g. :cpp:enumerator:`LV_COLOR_FORMAT_RGB565`).
it_it: Tutti i nomi dei formati seguenti vengono utilizzati nel codice anteponendo loro il prefisso ``LV_COLOR_FORMAT_`` (ad esempio :cpp:enumerator:`LV_COLOR_FORMAT_RGB565`).

source: All of the types can be used as API property types, but only a subset of them can be used as constant and :ref:`Subject <observer_subject>` types.
it_it: Tutti i tipi possono essere utilizzati come tipi di proprietà API, ma solo un sottoinsieme di essi può essere utilizzato come costante e come tipi :ref:`Subject <observer_subject>`.

source: All of this can be done with the UART instead of SSH if you don't want to connect the RPi4 to the network.
it_it: Tutto questo può essere fatto con l'UART invece che con SSH se non si vuol connettere l'RPi4 alla rete.

source: All optional targets can be disabled by setting the proper cache variables.
it_it: Tutti i target opzionali possono essere disabilitati impostando le variabili di cache appropriate.

source: All other renderers will ignore images with these color formats.
it_it: Tutti gli altri motori di rendering ignoreranno le immagini con questi formati colore.

source: All permutations of the below options are well supported.
it_it: Tutte le permutazioni delle opzioni seguenti sono ben supportate.

source: All possible permutations of these letters are supported so you do not have to remember what sequence works.
it_it: Sono supportate tutte le possibili permutazioni di queste lettere, quindi non si deve ricordare quale sequenza funziona.

source: All repositories of the LVGL project are hosted on `GitHub <https://github.com/lvgl>`_.
it_it: Tutti i repository del progetto LVGL sono ospitati su `GitHub <https://github.com/lvgl>`_.

source: All rights not expressly granted herein are reserved by LVGL LLC.
it_it: Tutti i diritti non espressamente concessi nel presente documento sono riservati a LVGL LLC.

source: All standard ``lv_obj`` functions work with GStreamer widgets (positioning, sizing, styling, events)
it_it: Tutte le funzioni standard ``lv_obj`` funzionano con i widget GStreamer (posizionamento, dimensionamento, stile, eventi).

source: All standard ``lv_obj`` functions work with glTF widgets (positioning, sizing, styling, etc.)
it_it: Tutte le funzioni standard ``lv_obj`` funzionano con i widget glTF (posizionamento, dimensionamento, stile, ecc.)

source: All steps
it_it: Tutti i passi

source: All text has a base direction (LTR or RTL) which determines some rendering rules and the default alignment of the text (left or right).
it_it: Tutto il testo ha una direzione di base (LTR o RTL) che determina alcune regole di rendering e l'allineamento di default del testo (sinistra o destra).

source: All the Grid-related values are style properties under the hood so you can use them as you would any other style property.
it_it: Tutti i valori relativi alla Grid sono proprietà di stile nascoste, quindi è possibile utilizzarle come qualsiasi altra proprietà di stile.

source: All the below operation can be done in addition with optional opacity.
it_it: Tutte le operazioni seguenti possono essere eseguite anche con opacità opzionale.

source: All these are described in the ``my_icon.xml`` in an encapsulated way but can be referenced in other timelines.
it_it: Tutti questi elementi sono descritti in ``my_icon.xml`` in modo incapsulato, ma possono essere referenziati in altre timeline.

source: All these common and versatile features are introduced in the :ref:`common_widget_features` chapter.
it_it: Tutte queste funzionalità comuni e versatili vengono presentate nel capitolo :ref:`common_widget_features`.

source: All these modules are pin-compatible, ensuring scalability of applications developed on them.
it_it: Tutti questi moduli sono compatibili a livello di pin, garantendo la scalabilità delle applicazioni sviluppate su di essi.

source: All these properties are inherited.
it_it: Tutte queste proprietà sono ereditate.

source: All typical color formats are supported, like i1...i8, a1...a8, rgb565, rgb888, argb8888, etc.
it_it: Sono supportati tutti i formati di colore tipici, come i1...i8, a1...a8, rgb565, rgb888, argb8888, ecc.

source: All valid image sources are supported, but a common source to use is one of the ``LV_SYMBOL_...`` macros, such as :c:macro:`LV_SYMBOL_CLOSE` to provide an "x" (close) symbol.
it_it: Sono supportate tutte le sorgenti di immagini valide, ma una sorgente comune da utilizzare è una delle macro ``LV_SYMBOL_...``, come :c:macro:`LV_SYMBOL_CLOSE` per fornire un simbolo "x" (chiudi).

source: All widget types share some basic attributes:
it_it: Tutti i tipi di widget condividono alcuni attributi di base:

source: Allows to set a custom path for ``lv_conf.h``
it_it: Consente di impostare un percorso personalizzato per ``lv_conf.h``

source: Allows to set a directory containing ``lv_conf.h``
it_it: Consente di impostare una directory contenente ``lv_conf.h``

source: Alongside the image name, you'll also find its ID (``2967a34a9e74`` in this example).
it_it: Oltre al nome dell'immagine, si troverà anche il suo ID (in questo esempio ``2967a34a9e74``).

source: Alongside these features, we've thoroughly reorganized and proofread the entire documentation suite, and included numerous new driver guides and platform integrations to better serve our partners and the embedded community.
it_it: Oltre a queste funzionalità, abbiamo riorganizzato e revisionato a fondo l'intera suite di documentazione e incluso numerose nuove guide per i driver e integrazioni di piattaforme per servire al meglio i nostri partner e la comunità embedded.

source: Alpha-Only and Special ARGB Formats
it_it: Formati ARGB Solo-Alfa e Speciali

source: Also Docker needs to be present on the development host.
it_it: Inoltre, Docker deve essere presente sull'host di sviluppo.

source: Also enable other required dependencies by setting the following defines to ``1``:
it_it: Abilitare anche altre dipendenze richieste impostando le seguenti definizioni a ``1``:

source: Also exclusive to Widgets, elements define sub-widgets or internal structures (e.g., chart series, dropdown lists, tab views).
it_it: Anche esclusivi dei Widget, gli elementi definiscono sotto-widget o strutture interne (ad esempio, serie di grafici, liste di dropdown, tab di view).

source: Also known as Event Capturing, if :cpp:expr:`lv_obj_add_flag(widget, LV_OBJ_FLAG_EVENT_TRICKLE)` is enabled all events will be sent to the Widget's children as well.
it_it: Noto anche come "Event Capturing", se :cpp:expr:`lv_obj_add_flag(widget, LV_OBJ_FLAG_EVENT_TRICKLE)` è abilitato, tutti gli eventi verranno inviati anche ai Widget figli.

source: Also note opening a project previously built on top of the FSP prior to v6.0 will trigger a dialog asking whether the user wants to migrate to the new FSP v6.0.
it_it: Si noti inoltre che l'apertura di un progetto precedentemente creato su FSP prima della versione 6.0 aprirà una finestra di dialogo che chiederà all'utente se desidera migrare al nuovo FSP v6.0.

source: Also note that the user must take care of arbitrating the bus when multiple devices are connected to it.
it_it: Si noti inoltre che l'utente deve occuparsi dell'arbitraggio del bus quando più dispositivi sono collegati ad esso.

source: Also observe, in direct mode, each buffer should have the space at least to hold at least the size of the screen, that is it, the height times the width times the bytes for a pixel (which is application dependent or display supported), on the code below this size is represented by `buf_size`.
it_it: Si noti inoltre che, in "direct mode", ogni buffer dovrebbe avere spazio sufficiente per contenere almeno le dimensioni dello schermo, ovvero l'altezza per la larghezza per i byte di un pixel (dipendente dall'applicazione o supportato dal display). Nel codice seguente, questa dimensione è rappresentata da `buf_size`.

source: Also set :c:macro:`LV_FFMPEG_PLAYER_USE_LV_FS` in ``lv_conf.h`` to ``1`` if you want to integrate the LVGL :ref:`file_system` extension into FFmpeg.
it_it: Impostare anche :c:macro:`LV_FFMPEG_PLAYER_USE_LV_FS` in ``lv_conf.h`` a ``1`` integrare l'estensione LVGL :ref:`file_system` in FFmpeg.

source: Also supported: GIF, SVGZ, TIF, TIFF, AI, DRW, PCT, PSP, XCF, PSD, RAW and HEIC.
it_it: Sono supportati anche: GIF, SVGZ, TIF, TIFF, AI, DRW, PCT, PSP, XCF, PSD, RAW e HEIC.

source: Also supports letter strokes.
it_it: Supporta anche gli "strok" [tratti] delle lettere.

source: Also the DMA2D is used to pick the output chunks from the PPA client and copy over to the destination buffer, or the display frame-buffer.
it_it: Il DMA2D viene inoltre utilizzato per prelevare i blocchi di output dal client PPA e copiarli nel buffer di destinazione, ovvero nel frame buffer del display.

source: Also uses the :ref:`typical background style properties <typical bg props>` as well as *text* properties.
it_it: Utilizza anche le :ref:`tipiche proprietà di stile del background <typical bg props>` e le proprietà *text*.

source: Also uses the :ref:`typical background style properties <typical bg props>`.
it_it: Utilizza anche le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: Also worth mentioning is STM32CubeMX; a graphical tool for generating the boilerplate code for an STM32 HAL project to build it outside of STM32CubeIDE.
it_it: Vale la pena menzionare anche STM32CubeMX, uno strumento grafico per generare il codice boilerplate per un progetto STM32 HAL, da compilare al di fuori di STM32CubeIDE.

source: Also, the sysroots have everything required to build lvgl library.
it_it: Inoltre, le sysroot contengono tutto il necessario per compilare la libreria lvgl.

source: Also, there are operations added in the task in ``lv-conf.inc``.
it_it: Inoltre, ci sono operazioni aggiunte al task in ``lv-conf.inc``.

source: Alternately, :cpp:expr:`lv_obj_set_property(widget, value)` could be called using this array's individual ``value`` elements inside a loop.
it_it: In alternativa, :cpp:expr:`lv_obj_set_property(widget, value)` potrebbe essere chiamata utilizzando i singoli elementi ``value`` di questo array all'interno di un ciclo.

source: Alternately, if you want to bind a Subject's value to a Widget's property, one of the ``lv_<widget_type>_bind_...()`` functions can be used.
it_it: In alternativa, se si desidera associare il valore di un Subject alla proprietà di un Widget, è possibile utilizzare una delle funzioni ``lv_<widget_type>_bind_...()``.

source: Alternately, labels can be rotated by a fixed amount (for any Scale mode).
it_it: In alternativa, le etichette possono essere ruotate di un valore fisso (per qualsiasi modalità della "Scale").

source: Alternately, you can provide your own Path function.
it_it: In alternativa, si può fornire una propria funzione Path.

source: Alternatively the theme can be extended with new styles.
it_it: In alternativa, il tema può essere esteso con nuovi stili.

source: Alternatively, ``lv_conf.h`` can be copied to another place but then you should add the :c:macro:`LV_CONF_INCLUDE_SIMPLE` define to your compiler options (e.g. ``-DLV_CONF_INCLUDE_SIMPLE`` for GCC compiler) and set the include path manually (e.g. ``-I../include/gui``).
it_it: In alternativa, ``lv_conf.h`` può essere copiato in un'altra posizione, ma in tal caso è necessario aggiungere la definizione :c:macro:`LV_CONF_INCLUDE_SIMPLE` alle opzioni del compilatore (ad esempio ``-DLV_CONF_INCLUDE_SIMPLE`` per il compilatore GCC) e impostare manualmente il path dell'include (ad esempio ``-I../include/gui``).

source: Alternatively, the ``bitmap_mask`` property in the draw descriptor can be used directly for image drawing.
it_it: In alternativa, la proprietà ``bitmap_mask`` nel descrittore di disegno può essere utilizzata direttamente per il disegno dell'immagine.

source: Alternatively, you can define LVGL configuration macros directly in ``platformio.ini`` under build_flags:
it_it: In alternativa, si possono definire le macro di configurazione LVGL direttamente in ``platformio.ini`` sotto build_flags:

source: Alternatively, you can use `TFT_eSPI <https://github.com/Bodmer/TFT_eSPI>`__ library.
it_it: In alternativa, si può usare la libreria `TFT_eSPI <https://github.com/Bodmer/TFT_eSPI>`__.
